
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/d5ec6d7f-943e-41ef-8f1e-889da358aa7d/terraform-bin plan -no-color
2024-04-21T08:06:26.852Z [INFO]  Terraform version: 1.8.1
2024-04-21T08:06:26.852Z [INFO]  Go runtime version: go1.22.1
2024-04-21T08:06:26.852Z [INFO]  CLI args: []string{"/home/runner/work/_temp/d5ec6d7f-943e-41ef-8f1e-889da358aa7d/terraform-bin", "plan", "-no-color"}
2024-04-21T08:06:26.852Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-04-21T08:06:26.855Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=506b9528-7d8f-19f6-e573-f3473dc84cf5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-04-21T08:06:27.451Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=506b9528-7d8f-19f6-e573-f3473dc84cf5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate
2024-04-21T08:06:27.589Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=506b9528-7d8f-19f6-e573-f3473dc84cf5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate
2024-04-21T08:06:27.927Z [INFO]  backend/local: starting Plan operation
2024-04-21T08:06:28.512Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=988a8e20-a630-51c3-8d90-776fde1833e1 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate
2024-04-21T08:06:28.658Z [INFO]  provider: configuring client automatic mTLS
2024-04-21T08:06:28.749Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:06:28.749Z
2024-04-21T08:06:29.378Z [INFO]  provider: configuring client automatic mTLS
2024-04-21T08:06:29.460Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:06:29.460Z
2024-04-21T08:06:29.575Z [INFO]  backend/local: plan calling Plan
2024-04-21T08:06:29.575Z [INFO]  provider: configuring client automatic mTLS
2024-04-21T08:06:29.661Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:06:29.661Z
2024-04-21T08:06:29.768Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=98624726-4b71-ff37-863a-b6904ac0c875 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_rpc=ConfigureProvider tf_aws.credentials_source=EnvConfigCredentials timestamp=2024-04-21T08:06:29.768Z
2024-04-21T08:06:30.341Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=98624726-4b71-ff37-863a-b6904ac0c875 timestamp=2024-04-21T08:06:30.341Z
2024-04-21T08:06:30.350Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
2024-04-21T08:06:30.358Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.algosolved_repository will be created
  + resource "aws_ecr_repository" "algosolved_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "algosolved"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"  = "algosolved"
          + "Stage" = "prod"
        }
      + tags_all             = {
          + "Name"  = "algosolved"
          + "Stage" = "prod"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.algosolved_repository will be created%0A  + resource "aws_ecr_repository" "algosolved_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "algosolved"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Name"  = "algosolved"%0A          + "Stage" = "prod"%0A        }%0A      + tags_all             = {%0A          + "Name"  = "algosolved"%0A          + "Stage" = "prod"%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-04-21T08:06:26.852Z [INFO]  Terraform version: 1.8.1%0A2024-04-21T08:06:26.852Z [INFO]  Go runtime version: go1.22.1%0A2024-04-21T08:06:26.852Z [INFO]  CLI args: []string{"/home/runner/work/_temp/d5ec6d7f-943e-41ef-8f1e-889da358aa7d/terraform-bin", "plan", "-no-color"}%0A2024-04-21T08:06:26.852Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-04-21T08:06:26.855Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=506b9528-7d8f-19f6-e573-f3473dc84cf5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-04-21T08:06:27.451Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=506b9528-7d8f-19f6-e573-f3473dc84cf5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate%0A2024-04-21T08:06:27.589Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=506b9528-7d8f-19f6-e573-f3473dc84cf5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate%0A2024-04-21T08:06:27.927Z [INFO]  backend/local: starting Plan operation%0A2024-04-21T08:06:28.512Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=988a8e20-a630-51c3-8d90-776fde1833e1 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate%0A2024-04-21T08:06:28.658Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-21T08:06:28.749Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:06:28.749Z%0A2024-04-21T08:06:29.378Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-21T08:06:29.460Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:06:29.460Z%0A2024-04-21T08:06:29.575Z [INFO]  backend/local: plan calling Plan%0A2024-04-21T08:06:29.575Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-21T08:06:29.661Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:06:29.661Z%0A2024-04-21T08:06:29.768Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=98624726-4b71-ff37-863a-b6904ac0c875 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_rpc=ConfigureProvider tf_aws.credentials_source=EnvConfigCredentials timestamp=2024-04-21T08:06:29.768Z%0A2024-04-21T08:06:30.341Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=98624726-4b71-ff37-863a-b6904ac0c875 timestamp=2024-04-21T08:06:30.341Z%0A2024-04-21T08:06:30.350Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A2024-04-21T08:06:30.358Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @rha6780**